app/Controllers/MobileRestController.php

SELECT *
FROM `mobile`
---
  public function findAll(){
    $mobileModel = new MobileModel();
    return $this->response->setStatusCode(200)->setJSON($mobileModel->findAll());

SELECT *
FROM `mobile`
WHERE `mobile`.`id` = '5'
---
  public function find($id){
    $mobileModel = new MobileModel();
    return $this->response->setStatusCode(200)->setJSON($mobileModel->find($id));

DELETE FROM `mobile`
WHERE `id` IN ('9')
---
  public function delete($id){
    $mobileModel = new MobileModel();
    $mobileModel->delete($id);